Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: · Package applications, for example those you have experience with or consider valuable for Debian. For more information on how to become a package maintainer, visit the Debian Developer's Corner.
pt_pt: · Empacote aplicativos, por exemplo aqueles que você tem experiência ou considera valiosos para o Debian. Para mais informações sobre como se tornar um(a) mantenedor(a) de pacote, visite o canto dos(as) desenvolvedores(as) Debian.

source: · Help to maintain existing applications, for example by contributing fixes (patches) or additional information in the Bug Tracking System. Alternatively, you can join a group maintenance team or join a software project on Salsa (our own GitLab instance).
pt_pt: · Ajude a manter os aplicativos existentes, por exemplo, contribuindo com correções (patches) ou informações adicionais no sistema de rastreamento de bugs. Alternativamente, você pode ingressar em uma equipe de manutenção de grupo ou ingressar em um projeto de software no Salsa (nossa própria instância GitLab).

source: · Assist us by tracking and fixing security issues in Debian.
pt_pt: · Ajude-nos rastreando e consertando problemas de segurança no Debian.

source: · You can also help with the hardening of packages, repositories and images, and other components.
pt_pt: · Você também pode ajudar com o fortalecimento de pacotes, repositórios e imagens e outros componentes.

source: · Interested in porting Debian to some architecture you are familiar with? You can start a new port or contribute to an existing one.
pt_pt: · Interessado(a) em portar o Debian para alguma arquitetura com a qual você está familiarizado(a)? Você pode iniciar um novo porte ou contribuir para um existente.

source: · Help us to improve Debian-related services or create and maintain new ones, suggested or requested by the community.
pt_pt: · Ajude-nos a melhorar os serviços relacionados ao Debian ou crie e mantenha novos serviços, sugeridos ou solicitados pela comunidade.

source: Testing and Bug Squashing
pt_pt: Teste e elimine bugs

source: Like any other software project, Debian needs users who test the operating system and its applications. One way to contribute is to install the latest version and report back to the developers if something doesn't work the way it should. We also need people to test our installation media, secure boot and the U-Boot bootloader on different hardware.
pt_pt: Como qualquer outro projeto de software, o Debian precisa de usuários(as) que testem o sistema operacional e seus aplicativos. Uma forma de contribuir é instalar a versão mais recente e relatar aos(as) desenvolvedores(as) se algo não funcionar como deveria. Também precisamos de pessoas para testar nossa mídia de instalação, o boot seguro e o carregador de boot U-Boot em hardwares diferentes.

source: · You can use our Bug Tracking System to report any issues you find in Debian. Before you do so, please make sure the bug hasn't already been reported.
pt_pt: · Você pode usar nosso sistema de rastreamento de bugs para relatar qualquer problema que encontrar no Debian. Antes disso, certifique-se de que o bug já não tenha sido relatado.

source: · Visit the bug tracker and try to browse the bugs associated with packages you use. See if you can provide further information and reproduce the issues described.
pt_pt: · Visite o rastreador de bugs e tente navegar pelos bugs associados aos pacotes que você usa. Veja se você pode fornecer mais informações e reproduzir os problemas descritos.

source: · Test the Debian installer and live ISO images, secure boot support, LTS updates, and the U-Boot bootloader.
pt_pt: · Teste o instalador e as imagens ISO live do Debian, o suporte ao boot seguro, as atualizações LTS e o carregador de boot U-Boot.

source: Writing Documentation and Tagging Packages
pt_pt: Escreva documentação e marque pacotes

source: If you experience any problems in Debian and can't write code to solve the issue, maybe taking notes and writing down your solution is an option for you. That way you can help other users who may have similar problems. All Debian documentation is written by community members and there are several ways you can help.
pt_pt: Se você tiver problemas no Debian e não conseguir escrever código para resolvê-los, talvez fazer anotações e escrever sua solução seja uma opção para você. Dessa forma, pode ajudar outros(as) usuários(as) que têm problemas semelhantes. Toda a documentação do Debian é escrita por membros(as) da comunidade e existem várias maneiras de você ajudar.

source: · Join the Debian Documentation Project to help with the official Debian documentation.
pt_pt: · Ingresse no projeto de documentação do Debian para ajudar com a documentação oficial do Debian.

source: · Contribute to the Debian Wiki
pt_pt: · Contribua para a Wiki do Debian.

source: · Tag and categorize packages on the Debtags website, so that Debian users can easily find the software they are looking for.
pt_pt: · Marque e categorize pacotes no site web debtags, para que nossos(as) usuários(as) possam encontrar softwares mais facilmente.

source: Translating and Localizing
pt_pt: Traduza e localize

source: Your native language isn't English, but you have good enough English language skills to understand and translate software or Debian-related information like web pages, documentation, etc.? Why not join a translation team and convert Debian applications to your mother tongue. We're also looking for people to check existing translations and file bug reports if necessary.
pt_pt: Seu idioma nativo não é o inglês, mas você tem bons conhecimentos de inglês o suficiente para entender e traduzir software ou informações relacionadas ao Debian como páginas web, documentação, etc? Por que não se juntar a uma equipe de tradução e converter aplicativos Debian para sua língua materna? Também estamos procurando pessoas para verificar as traduções existentes e enviar relatórios de erros, se necessário. · Tudo relacionado à internacionalização do Debian é discutido na lista de discussão i18n.

source: · Everything connected with Debian's internationalization is discussed on the i18n mailing list.
pt_pt: · Você é um(a) falante nativo(a) de um idioma que ainda não é suportado no Debian? Entre em contato por meio da página Debian internacional.

source: · Are you a native speaker of a language which isn't supported in Debian yet? Get in touch via the Debian International page.
pt_pt: · Você encontrará mais informações do projeto de tradução do Debian para o português nas páginas do projeto.

source: Helping other Users
pt_pt: Ajude outros(as) usuários(as)

source: You can also contribute to the project by helping other Debian users. The project uses various support channels, for example mailing lists in different languages, and IRC channels. For more information, please visit our support pages.
pt_pt: Você também pode contribuir com o projeto ajudando outros(as) usuários(as) Debian. O projeto usa vários canais de suporte, por exemplo, listas de discussão em diferentes idiomas e canais de IRC. Para obter mais informações, visite nossas páginas de suporte.

source: · The Debian project uses a lot of different mailing lists; some are for developers and some are for users. Experienced users can help others through the user mailing lists.
pt_pt: · O projeto Debian usa muitas listas de discussão diferentes; algumas são para desenvolvedores(as) e algumas são para usuários(as). Usuários(as) experientes podem ajudar outras pessoas por meio das listas de discussão de usuários(as).

source: · People from all over the world chat in real-time on IRC (Internet Relay Chat). Visit the channel #debian on OFTC to chat with other Debian users.
pt_pt: · Pessoas de todo o mundo conversam em tempo real no IRC (Internet Relay Chat). Visite o canal #debian no OFTC para conversar com outros(as) usuários(as) Debian.

source: Organizing Events
pt_pt: Organize eventos

source: Apart from the annual Debian conference (DebConf), there are several smaller meetings and get-togethers in different countries every year. Taking part or helping to organize an event is a great opportunity to meet other Debian users and developers.
pt_pt: Além da conferência anual Debian (DebConf), existem várias reuniões e encontros menores e em diferentes países todos os anos. Participar ou ajudar a organizar um evento é uma grande oportunidade de conhecer outros(as) usuários(as) e desenvolvedores(as) Debian.

source: · Help out during the annual Debian conference, for example by recording videos of talks and presentations, greetings attendees and helping speakers, organizing special events during DebConf (like the cheese and wine party), helping with the setup and teardown, etc.
pt_pt: · Ajude durante a conferência anual Debian, por exemplo gravando vídeos das palestras e apresentações, recebendo os(as) participantes e ajudando os palestrantes, organizando eventos especiais durante a DebConf (como a festa dos queijos e do vinhos), ajudando na montagem e desmontagem, etc.

source: · Additionally, there are several MiniDebConf events, local meetings organized by Debian project members.
pt_pt: · Além disso, existem vários eventos chamados de MiniDebConf, reuniões locais organizadas por membros(as) do projeto Debian.

source: · You can also create or join a local Debian group with regular meetings or other activities.
pt_pt: · Você também pode criar ou ingressar em um grupo Debian local com reuniões regulares ou outras atividades.

source: · Also, check out other events like Debian Day parties, release parties, bug squashing parties, development sprints, or other events around the world.
pt_pt: · Além disso, verifique outros eventos como festas do dia do Debian (Debian day), festas de lançamento (release parties), festas de caça aos bugs (bug squashing parties), sprints de desenvolvimento ou outros eventos pelo mundo.

source: Donate Money, Hardware, or Bandwidth
pt_pt: Doe dinheiro, hardware ou largura de banda

source: All donations to the Debian project are managed by our Debian Project Leader (DPL). With your support we can purchase hardware, domains, cryptographic certificates, etc. We also use funds to sponsor DebConf and MiniDebConf events, development sprints, presence at other events, and other things.
pt_pt: Todas as doações para o projeto Debian são gerenciadas por nosso(a) líder do projeto Debian (DPL - Debian Project Leader). Com o seu apoio, podemos comprar hardware, domínios, certificados criptográficos, etc. Também usamos fundos para patrocinar os eventos DebConf e MiniDebConf, sprints de desenvolvimento, presença em outros eventos e outras coisas.

source: · You can donate money, equipment and services to the Debian project.
pt_pt: · Você pode doar dinheiro, equipamentos e serviços para o projeto Debian.

source: · We're constantly looking for mirrors worldwide.
pt_pt: · Estamos constantemente procurando por espelhos no mundo todo.

source: · For our Debian ports, we rely on our autobuilder network.
pt_pt: · Para nossos portes Debian, contamos com nossa rede autobuilder.

source: Use Debian and talk about it
pt_pt: Use o Debian e fale sobre ele

source: Spread the word and tell others about Debian and the Debian community. Recommend the operating system to other users, and show them how to install it. Simply use it and enjoy -- that's probably the easiest way to give back to the Debian project.
pt_pt: Divulgue e fale para outras pessoas sobre o Debian e a comunidade Debian. Recomende o sistema operacional a outros(as) usuários(as) e mostre como instalá-lo. Simplesmente use-o e divirta-se -- essa é provavelmente a maneira mais fácil de retribuir ao projeto Debian.

source: · Help to promote Debian by giving a talk and demonstrating it to other users.
pt_pt: · Ajude a promover o Debian dando uma palestra e demonstrando para outros(as) usuários(as).

source: · Contribute to our website and help us to improve Debian's public face.
pt_pt: · Contribua com nosso site web e nos ajude a melhorar a face pública do Debian.

source: · Take screenshots and upload them to screenshots.debian.net so that our users can see what software in Debian looks like before using it.
pt_pt: · Faça capturas de tela e faça o upload delas para screenshots.debian.net para que nossos(as) usuários(as) possam ver a aparência do software no Debian antes de usá-lo.

source: · You can enable popularity-contest submissions so we know which packages are popular and most useful to everyone.
pt_pt: · Você pode habilitar envios para o concurso de popularidade para que possamos saber quais pacotes são populares e mais úteis para todos(as).

source: How your Organization can support Debian
pt_pt: Como sua organização pode ajudar o Debian

source: Whether you work at an educational, commercial, non-profit, or government organization, there are plenty of ways to support us with your resources.
pt_pt: Quer você trabalhe em uma organização educacional, comercial, sem fins lucrativos ou governamental, existem muitas maneiras de nos apoiar com seus recursos.

source: · For example, your organization could simply donate money or hardware.
pt_pt: · Por exemplo, sua organização pode simplesmente doar dinheiro ou hardware.

source: · Maybe you'd like to sponsor our conferences.
pt_pt: · Talvez você queira patrocinar nossas conferências.

source: · Your organization could provide products or services to Debian contributors.
pt_pt: · Sua organização pode fornecer produtos ou serviços para contribuidores(as) Debian.

source: · We're also looking for free hosting.
pt_pt: · Também estamos procurando por hospedagem gratuita.

source: · Of course, setting up mirrors for our software, the installation media, or conference videos is also greatly appreciated.
pt_pt: · Claro, configurando espelhos para nosso software, para mídias de instalação ou para vídeos das conferências também é muito apreciado.

source: · Maybe you'd also consider selling Debian merchandise, installation media, or pre-installed systems.
pt_pt: · Talvez você também considere vender merchandise do Debian, mídias de instalação ou sistemas pré-instalados.

source: · If your organization offers Debian consulting or hosting, please let us know.
pt_pt: · Se sua organização oferece consultoria ou hospedagem, nos informe.

source: We're also interested in forming partnerships. If you can promote Debian by providing a testimonial, running it on your organization's servers or desktops, or even encourage your staff to participate in our project, that's fantastic. Maybe you'd also consider teaching about the Debian operating system and community, directing your team to contribute during working hours or sending them to one of our events.
pt_pt: Também estamos interessados(as) em formar parcerias. Se você pode promover o Debian fornecendo um depoimento, rodando nos servidores ou desktops de sua organização, ou mesmo encorajando sua equipe a participar do nosso projeto, isso é fantástico. Talvez você também considere ensinar sobre o sistema operacional Debian e a comunidade, direcionando sua equipe para contribuir durante o horário de trabalho ou enviando-os para um de nossos eventos.

source: Български (Bəlgarski) česky dansk Deutsch Ελληνικά (Ellinika) español فارسی (Farsi) français Italiano 한국어 (Korean) Nederlands 日本語 (Nihongo) polski Português Русский (Russkij) slovenčina suomi svenska Tiếng Việt українська (ukrajins'ka) 中文(简) 中文(HK) 中文(繁)
pt_pt: Български (Bəlgarski) česky dansk Deutsch Ελληνικά (Ellinika) English español فارسی (Farsi) français Italiano 한국어 (Korean) Nederlands 日本語 (Nihongo) polski Русский (Russkij) slovenčina suomi svenska Tiếng Việt українська (ukrajins'ka) 中文(简) 中文(HK) 中文(繁)

source: Last Modified: Mon, Jul 18 18:39:26 UTC 2022 Last Built: Tue, Aug 6 19:47:26 UTC 2024
pt_pt: Última Modificação: Ter, 19 de Jul de 2022, 13:24:53 UTC Última compilação: Ter, 6 de Ago de 2024, 22:07:07 UTC

source: Security Information / Debian security FAQ
pt_pt: Informações de segurança / FAQ de segurança Debian

source: Debian security FAQ
pt_pt: FAQ de segurança Debian

source: 1. I received a DSA via debian-security-announce, how can I upgrade the vulnerable packages?
pt_pt: 1. Eu recebi um DSA pela lista debian-security-announce, como eu posso atualizar o pacote vulnerável?

source: 2. The signature on your advisories does not verify correctly!
pt_pt: 2. A assinatura em seus alertas não foi verificada corretamente!

source: 3. How is security handled in Debian?
pt_pt: 3. Como o Debian lida com a segurança?

source: 4. Why are you fiddling with an old version of that package?
pt_pt: 4. Por que vocês insistem em uma versão antiga de determinado pacote?

source: 5. The version number for a package indicates that I am still running a vulnerable version!
pt_pt: 5. O número de versão de um pacote indica que eu ainda estou executando uma versão vulnerável!

source: 6. I received an advisory, but the build for one processor architecture seems to be missing.
pt_pt: 6. Eu recebi um alerta, mas parece que está faltando a construção do pacote para uma arquitetura de processamento .

source: 7. How is security handled for unstable?
pt_pt: 7. Como a segurança é feita na instável (unstable)?

source: 8. How is security handled for testing?
pt_pt: 8. Como a segurança é feita na teste (testing)?

source: 9. How is security handled for contrib, non-free and non-free-firmware?
pt_pt: 9. Como a segurança é feita para a contrib, a non-free e a non-free-firmware?

source: 10. The advisory says unstable is fixed in version 1.2.3-1, but unstable has 1.2.5-1, what's up?
pt_pt: 10. O alerta diz que a instável (unstable) foi corrigida na versão 1.2.3-1, mas a instável (unstable) contém a versão 1.2.5-1, o que aconteceu?

source: 11. Why are there no official mirrors for security.debian.org?
pt_pt: 11. Por que não há espelhos oficiais do security.debian.org?

source: 12. I've seen DSA 100 and DSA 102, now where is DSA 101?
pt_pt: 12. Vi o DSA 100 e o DSA 102, agora, onde está o DSA 101?

source: 13. How can I reach the security team?
pt_pt: 13. Como posso entrar em contato com o Time de Segurança?

source: 14. I guess I found a security problem, what should I do?
pt_pt: 14. Acho que encontrei um problema de segurança, o que devo fazer?

source: 15. What am I supposed to do with a security problem in one of my packages?
pt_pt: 15. O que eu devo fazer com um problema de segurança em um dos meus pacotes?

source: 16. I tried to download a package listed in one of the security advisories, but I got a `file not found' error.
pt_pt: 16. Eu tentei baixar um pacote listado em um dos alertas de segurança, mas recebo um erro 'arquivo não encontrado'.

source: 17. I've got a bugfix, can I upload to security.debian.org directly?
pt_pt: 17. Eu tenho uma correção de bug. Posso enviar diretamente para security.debian.org?

source: 18. I've got a bugfix, can I upload to proposed-updates instead?
pt_pt: 18. Eu tenho uma correção de bug, posso então enviar para o proposed-updates?

source: 19. I'm pretty sure my packages are fine, how can I upload them?
pt_pt: 19. Tenho certeza que meus pacotes estão corretos, como posso enviá-los?

source: 20. How can I help with security?
pt_pt: 20. Como posso ajudar com a segurança?

source: 21. What is the scope of proposed-updates?
pt_pt: 21. Qual é o escopo do proposed-updates?

source: 22. How is the security team composed?
pt_pt: 22. Como o Time de Segurança é composto?

source: 23. How long will security updates be provided?
pt_pt: 23. Por quanto tempo as atualizações de segurança são fornecidas?

source: 24. How can I check the integrity of packages?
pt_pt: 24. Como verifico a integridade de um pacote?

source: 25. What to do if a random package breaks after a security update?
pt_pt: 25. O que fazer quando um pacote aleatório quebra após uma atualização de segurança?

source: 26. What is a CVE identifier?
pt_pt: 26. O que é um identificador CVE?

source: 27. Does Debian issue a DSA for every CVE id?
pt_pt: 27. O Debian lança um DSA para cada identificador CVE?

source: 28. Can Debian assign CVE identifiers?
pt_pt: 28. O Debian pode definir identificadores CVE?

source: 29. Does Debian have a vulnerability disclosure policy?
pt_pt: 29. O Debian possui uma política de divulgação de vulnerabilidades?

source: 30. Our vulnerability management tool has shown that the following issues are open (list of CVEs with random CVSS scores). When are those going to be fixed?
pt_pt: 30. Nossa ferramenta de gerenciamento de vulnerabilidades mostrou que os seguintes problemas estão abertos (lista de CVEs com pontuações CVSS aleatórias). Quando eles serão corrigidos?

source: 31. What does local (remote) mean?
pt_pt: 31. O que significa local (remote)?

source: Q: I received a DSA via debian-security-announce, how can I upgrade the vulnerable packages?
pt_pt: Q: Eu recebi um DSA pela lista debian-security-announce, como eu posso atualizar o pacote vulnerável?

source: A: As the DSA mail says, you should upgrade the packages affected by the announced vulnerability. You can do this by just upgrading (after updating the list of available packages with apt-get update) every package in your system with apt-get upgrade or by upgrading just a particular package, with apt-get install package.
pt_pt: R: Como está no DSA do e-mail, você deve atualizar os pacotes afetados por tal vulnerabilidade. Para fazê-lo, basta realizar as atualizações update e depois upgrade. Isto é, atualize (update) a lista de pacotes disponíveis com apt-get update e depois atualize (upgrade) cada pacote do seu sistema com apt-get upgrade, ou atualize somente um determinado pacote com apt-get install package.

source: The announcement mail mentions the source package in which the vulnerability was present. Therefore, you should update all the binary packages from that source package. To check the binary packages to update, visit https://packages.debian.org/src:source-package-name and click on [show ... binary packages] for the distribution you are updating.
pt_pt: O e-mail de alerta menciona o pacote-fonte no qual a vulnerabilidade está presente. Desse modo, você deve atualizar todos os pacotes binários daquele pacote-fonte. Para verificar qual pacote binário deve ser atualizado, visite https://packages.debian.org/src:nome-do-pacote-fonte e clique em [mostrar ... pacotes binários] para a distribuição na qual você está atualizando.

source: It may also be necessary to restart a service or a running process. The command checkrestart included in the package debian-goodies might help to find which ones.
pt_pt: Também pode ser necessário reiniciar um serviço ou um processo que esteja rodando. O comando checkrestart incluído no pacote debian-goodies pode ajudar a encontrar tais serviços e processos.

source: Q: The signature on your advisories does not verify correctly!
pt_pt: Q: A assinatura em seus alertas não foi verificada corretamente!

source: A: This is most likely a problem on your end. The debian-security-announce list has a filter that only allows messages with a correct signature from one of the security team members to be posted.
pt_pt: R: Provavelmente você está fazendo algo errado. A lista debian-security-announce possui um filtro que só permite que mensagens sejam postadas se estiverem com a assinatura correta de um(a) dos(as) membros(as) do Time de Segurança.

source: Most likely some piece of mail software on your end slightly changes the message that breaks the signature. Make sure your software does not do any MIME encoding or decoding, or tab/space conversions.
pt_pt: Provavelmente, seu software de e-mail está alterando sutilmente a mensagem, o que invalida a assinatura. Certifique-se de que seu programa não faça codificação ou decodificação MIME, e não faça conversões de tabulação/espaços.
